import os
from config import Config

class Translation(object):
  START_TXT = """<b>ʜᴇʏ ᴅᴇᴀʀ ɢʀᴀɴᴅᴄʜɪʟᴅ {}

ɪ'ᴍ ʏᴏᴜʀ ᴛʀᴜsᴛᴇᴅ ᴏʟᴅ ɢʀᴀɴᴅᴘᴀ's ᴍᴇssᴀɢᴇ ꜰᴏʀᴡᴀʀᴅᴇʀ 👴
ʟᴇᴛ ᴍᴇ ʜᴇʟᴘ ʏᴏᴜ sʜᴀʀᴇ ᴍᴇssᴀɢᴇs ʟɪᴋᴇ ɪ sʜᴀʀᴇ ʟɪꜰᴇ ᴡɪsᴅᴏᴍ

ᴄʟɪᴄᴋ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ꜰᴏʀ ɢʀᴀɴᴅᴘᴀ's ᴛɪᴘs 🤓</b>"""

  DONATE_TXT = """<b><i>ɪꜰ ʏᴏᴜ ʟᴏᴠᴇ ʏᴏᴜʀ ɢʀᴀɴᴅᴘᴀ's ʜᴇʟᴘ 👴❤️. ᴄᴏɴsɪᴅᴇʀ ʙᴜʏɪɴɢ ʜɪᴍ ᴀ ᴄᴜᴘ ᴏꜰ ᴄᴏꜰꜰᴇᴇ ☕

ᴜᴘɪ ɪᴅ - </i></b><code>pay-to-grandpa-wisdom@coffee</code>"""

  HELP_TXT = """<b><u>🧓 ɢʀᴀɴᴅᴘᴀ's ᴡɪsᴅᴏᴍ ʜᴇʟᴘ</b></u>

<u>**📖 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅs:**</u>

<b>⏣ __/start - ᴄʜᴇᴄᴋ ɪꜰ ɢʀᴀɴᴅᴘᴀ ɪs ʜᴇʀᴇ__ 
⏣ __/forward - sʜᴀʀᴇ ᴍᴇssᴀɢᴇs ʟɪᴋᴇ ᴀ ᴡɪsᴇ ᴍᴀɴ__
⏣ __/unequify - ᴄʟᴇᴀɴ ᴜᴘ ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴛᴀʟᴇs__
⏣ __/settings - ᴄᴏɴꜰɪɢᴜʀᴇ ʏᴏᴜʀ ᴡɪsᴅᴏᴍ__
⏣ __/reset - ʀᴇsᴇᴛ ʏᴏᴜʀ ʟᴇᴀʀɴɪɴɢs__
⏣ __/donate - ꜱᴜᴘᴘᴏʀᴛ ᴏʟᴅ ᴀɢᴇ__
⏣ __/stop - ᴘᴀᴜsᴇ ᴛʜᴇ ᴡɪsᴅᴏᴍ ꜱʜᴀʀɪɴɢ__</b>

<b><u>💡 ɢʀᴀɴᴅᴘᴀ's ᴍᴀɢɪᴄ:</b></u>
<b>► __sʜᴀʀᴇ ᴍᴇssᴀɢᴇs ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟs ᴡɪᴛʜ ᴇᴀsᴇ__
► __ɴᴏ ᴄᴏᴍᴘʟɪᴄᴀᴛᴇᴅ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴs__
► __ᴀᴅᴅ ᴄᴜsᴛᴏᴍ ʟᴏᴠᴇ ɴᴏᴛᴇs (ᴄᴀᴘᴛɪᴏɴs)__
► __ᴄʀᴇᴀᴛᴇ ꜱᴡᴇᴇᴛ ʙᴜᴛᴛᴏɴs__
► __sᴜᴘᴘᴏʀᴛ ᴀʟʟ ᴄʜᴀᴛ ᴛʏᴘᴇs__
► __sᴋɪᴘ ʀᴇᴘᴇᴀᴛᴇᴅ ᴛᴀʟᴇs__
► __ꜰɪʟᴛᴇʀ ᴡɪsᴅᴏᴍ ᴛʏᴘᴇs__
► __sᴋɪᴘ ᴜɴɴᴇᴄᴇssᴀʀʏ ᴛᴀʟᴇs__</b>
"""

  HOW_USE_TXT = """<b><u>⚠️ ʙᴇꜰᴏʀᴇ sʜᴀʀɪɴɢ ᴡɪsᴅᴏᴍ:</b></u>
<b>► __ᴀᴅᴅ ᴀ ʙᴏᴛ ᴏʀ ʜᴇʟᴘᴇʀ__
► __ᴀᴅᴅ ᴀᴛ ʟᴇᴀsᴛ ᴏɴᴇ ᴄʜᴀɴɴᴇʟ__ `(ʏᴏᴜʀ ʙᴏᴛ ᴍᴜsᴛ ʙᴇ ᴀ ᴄʜᴀᴛ ᴡɪᴢᴀʀᴅ)`
► __ʏᴏᴜ ᴄᴀɴ ᴀᴅᴅ ᴄʜᴀᴛs ʙʏ ᴜsɪɴɢ /settings__
► __ɪꜰ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ɪs ᴘʀɪᴠᴀᴛᴇ, ʏᴏᴜʀ ʜᴇʟᴘᴇʀ ᴍᴜsᴛ ʙᴇ ᴀ ᴍᴇᴍʙᴇʀ__
► __ᴛʜᴇɴ ᴜsᴇ /forward ᴛᴏ sʜᴀʀᴇ ᴡɪsᴅᴏᴍ__</b>"""

  ABOUT_TXT = """<b>
╔════❰ ɢʀᴀɴᴅᴘᴀ's ᴍᴇssᴀɢᴇ ꜱʜᴀʀᴇʀ ❱═❍⊱❁
║╭━━━━━━━━━━━━━━━➣
║┣⪼📜 ʙᴏᴛ : ᴡɪsᴅᴏᴍ ꜱʜᴀʀᴇʀ
║┣⪼👴 ᴄʀᴇᴀᴛᴏʀ : ᴡɪsᴇ ɢʀᴀɴᴅᴘᴀ
║┣⪼💻 ʜᴏsᴛᴇᴅ ᴏɴ : ᴄʟᴏᴜᴅ ᴏꜰ ᴇxᴘᴇʀɪᴇɴᴄᴇ
║┣⪼🧠 ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ ᴏꜰ ᴡɪsᴅᴏᴍ
║┣⪼📚 ʟɪʙʀᴀʀʏ : ᴘʏʀᴏɢʀᴀᴍ ᴏꜰ ᴄᴏɴɴᴇᴄᴛɪᴏɴ
║┣⪼🕰️ ᴠᴇʀsɪᴏɴ : 1.0.6 (ᴀɢᴇᴅ ᴡɪsᴇʟʏ)
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁</b>"""

  STATUS_TXT = """<b>
╔════❰ ɢʀᴀɴᴅᴘᴀ's ʙᴏᴛ sᴛᴏʀʏ  ❱═❍⊱❁
║╭━━━━━━━━━━━━━━━➣
║┣⪼👥 ᴛᴏᴛᴀʟ ᴡɪsᴇ ꜰᴏʟʟᴏᴡᴇʀs : <code>{}</code>
║┃
║┣⪼🤖 ᴍᴇssᴀɢᴇ ᴡɪᴢᴀʀᴅs : <code>{}</code>
║┃
║┣⪼🔁 ᴡɪsᴅᴏᴍ sʜᴀʀᴇᴅ : <code>{}</code>
║┃
║┣⪼🔍 ᴄʟᴇᴀɴᴇᴅ ᴅᴜᴘʟɪᴄᴀᴛᴇs: <code>0</code>
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁</b>""" 

  SERVER_TXT = """<b>
╔════❰ ɢʀᴀɴᴅᴘᴀ's sᴇʀᴠᴇʀ ʜᴇᴀʟᴛʜ  ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼ ᴛᴏᴛᴀʟ ᴍᴇᴍᴏʀʏ: <code>38 GB</code>
║┣⪼ ᴜsᴇᴅ: <code>1.54 GB</code>
║┣⪼ ꜰʀᴇᴇ: <code>36.46 GB</code>
║┣⪼ ʙʀᴀɪɴ ᴘᴏᴡᴇʀ: <code>{}%</code>
║┣⪼ ᴍᴇᴍᴏʀʏ ʀᴇᴄᴀʟʟ: <code>{}%</code>
║╰━━━━━━━━━━━━━━━➣
╚══════════════════❍⊱❁۪۪</b>"""
  
  FROM_MSG = "<b>❪ ᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴡɪsᴅᴏᴍ sᴏᴜʀᴄᴇ ❫\n\nꜰᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀsᴛ ᴍᴇssᴀɢᴇ ᴏʀ ᴍᴇssᴀɢᴇ ʟɪɴᴋ.\n/cancel - sᴛᴏᴘ ᴛʜɪs ᴛᴀʟᴇ</b>"

  # (Previous code continues...)

  TO_MSG = "<b>❪ ᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴡɪsᴅᴏᴍ ᴅᴇsᴛɪɴᴀᴛɪᴏɴ ❫\n\nᴄʜᴏᴏsᴇ ʏᴏᴜʀ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ ꜰʀᴏᴍ ᴛʜᴇ ʙᴜᴛᴛᴏɴs.\n/cancel - sᴛᴏᴘ ᴛʜɪs ᴡɪsᴅᴏᴍ ᴛʀᴀɴsꜰᴇʀ</b>"

  SKIP_MSG = """<b><u>sᴇᴛ ɴᴜᴍʙᴇʀ ᴏꜰ ᴛᴀʟᴇs ᴛᴏ sᴋɪᴘ 📖</u></b>

<b>ʏᴏᴜ ᴄᴀɴ sᴋɪᴘ ᴄᴇʀᴛᴀɪɴ ᴍᴇssᴀɢᴇs ʟɪᴋᴇ sᴋɪᴘᴘɪɴɢ ᴜɴɪɴᴛᴇʀᴇsᴛɪɴɢ sᴛᴏʀɪᴇs.

ᴅᴇꜰᴀᴜʟᴛ sᴋɪᴘ ɴᴜᴍʙᴇʀ = 0</b>

<b><i>ᴇxᴀᴍᴘʟᴇ: ɪꜰ ʏᴏᴜ ᴇɴᴛᴇʀ 0, ɴᴏ ᴛᴀʟᴇs ᴡɪʟʟ ʙᴇ sᴋɪᴘᴘᴇᴅ.
ɪꜰ ʏᴏᴜ ᴇɴᴛᴇʀ 5, ᴛʜᴇ ꜰɪʀsᴛ 5 ᴛᴀʟᴇs ᴡɪʟʟ ʙᴇ sᴋɪᴘᴘᴇᴅ.</i></b>

/cancel <b>- sᴛᴏᴘ ᴛʜɪs ᴡɪsᴅᴏᴍ ᴛʀᴀɴsꜰᴇʀ</b>"""

  CANCEL = "<b>ɢʀᴀɴᴅᴘᴀ's ᴡɪsᴅᴏᴍ ᴛʀᴀɴsꜰᴇʀ sᴛᴏᴘᴘᴇᴅ!</b>"

  BOT_DETAILS = "<b><u>📜 ʙᴏᴛ ᴅᴇᴛᴀɪʟs</b></u>\n\n<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>\n<b>➣ ʙᴏᴛ ɪᴅ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}"

  USER_DETAILS = "<b><u>📜 ʜᴇʟᴘᴇʀ ʙᴏᴛ ᴅᴇᴛᴀɪʟs</b></u>\n\n<b>➣ ɴᴀᴍᴇ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀ ɪᴅ:</b> <code>{}</code>\n<b>➣ ᴜsᴇʀɴᴀᴍᴇ:</b> @{}"
         
  TEXT = """<b>╔════❰ ᴡɪsᴅᴏᴍ sʜᴀʀɪɴɢ sᴛᴀᴛᴜs ❱═❍⊱❁
║╭━━━━━━━━━━━━━━━➣
║┣⪼<b>𖨠 ᴛᴏᴛᴀʟ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ꜰᴇᴛᴄʜᴇᴅ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 sʜᴀʀᴇᴅ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ᴅᴜᴘʟɪᴄᴀᴛᴇ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ᴅᴇʟᴇᴛᴇᴅ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 sᴋɪᴘᴘᴇᴅ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ꜰɪʟᴛᴇʀᴇᴅ ᴛᴀʟᴇs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs: </b> <code>{}</code>
║┃
║┣⪼<b>𖨠 ᴘʀᴏɢʀᴇss: </b> <code>{}</code>%
║╰━━━━━━━━━━━━━━━➣ 
╚════❰ <b>{}</b> ❱══❍⊱❁"""

  DUPLICATE_TEXT = """
╔════❰ ᴄʟᴇᴀɴɪɴɢ ʟɪꜰᴇ's ʀᴇᴘᴇᴛɪᴛɪᴏɴs ❱═❍⊱❁۪۪
║╭━━━━━━━━━━━━━━━➣
║┣⪼ <b>ꜰᴇᴛᴄʜᴇᴅ ᴛᴀʟᴇs:</b> <code>{}</code>
║┃
║┣⪼ <b>ʀᴇᴘᴇᴀᴛᴇᴅ ᴛᴀʟᴇs ʀᴇᴍᴏᴠᴇᴅ:</b> <code>{}</code> 
║╰━━━━━━━━━━━━━━━➣
╚════❰ {} ❱══❍⊱❁۪۪
"""

  DOUBLE_CHECK = """<b><u>ᴅᴏᴜʙʟᴇ-ᴄʜᴇᴄᴋɪɴɢ ᴡɪsᴅᴏᴍ 📜</b></u>

<b>ʙᴇꜰᴏʀᴇ sʜᴀʀɪɴɢ ᴛᴀʟᴇs, ᴄʟɪᴄᴋ ᴛʜᴇ ʏᴇs ʙᴜᴛᴛᴏɴ ᴀꜰᴛᴇʀ ᴄᴀʀᴇꜰᴜʟ ʀᴇᴠɪᴇᴡ</b>

<b>★ ʏᴏᴜʀ ᴡɪsᴅᴏᴍ sʜᴀʀᴇʀ: {botname}</b>
<b>★ ᴡɪsᴅᴏᴍ sᴏᴜʀᴄᴇ: {from_chat}</b>
<b>★ ᴡɪsᴅᴏᴍ ᴅᴇsᴛɪɴᴀᴛɪᴏɴ: {to_chat}</b>
<b>★ sᴋɪᴘ ᴛᴀʟᴇs: {skip}</b>

<i><b>° {botname} ᴍᴜsᴛ ʙᴇ ᴀ ᴡɪsᴇ ᴡɪᴢᴀʀᴅ ɪɴ ᴛᴀʀɢᴇᴛ ᴄʜᴀᴛ</i> ({to_chat})</b>
<i><b>° ɪꜰ ᴛʜᴇ sᴏᴜʀᴄᴇ ɪs ᴀ ᴘʀɪᴠᴀᴛᴇ ʀᴇᴀʟᴍ, ʏᴏᴜʀ ʜᴇʟᴘᴇʀ ᴍᴜsᴛ ʙᴇ ᴀ ᴍᴇᴍʙᴇʀ</b></i>

<b>ɪꜰ ᴇᴠᴇʀʏᴛʜɪɴɢ ʟᴏᴏᴋs ᴡɪsᴇ, ᴛʜᴇɴ ᴄʟɪᴄᴋ ʏᴇs</b>"""

